JEB12345/dwm1000_dspic/dwm_spi.c
/* 
 * File:   dwm_spi.c
 * Author: jonathan
 *
 * Created on June 9, 2015, 11:17 AM
 */

#include "dwm_spi.h"
#include "decadriver/deca_device_api.h"
#include "decadriver/deca_regs.h"
#include <stdlib.h>
#include <spi.h>
#include <string.h>
#include <xc.h>

dwm_1000_status dwm_status;
uint16_t wait_count = 0;
uint16_t stall_count = 0;
anchor_states anchor_state = anchor_init;
tag_states tag_state = tag_init;


/**
     * Code Copied directly or modified
     * from polypoint github code
     * https://github.com/lab11/polypoint
     */
    dwt_config_t global_ranging_config;
    dwt_txconfig_t global_tx_config;

    const uint8_t xtaltrim[11] = {
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8
    };

    const uint8_t pgDelay[8] = {
        0x0,
        0xc9,
        0xc2,
        0xc5,
        0x95,
        0xc0,
        0x0,
        0x93
    };

    const uint8_t txPower16[8] = {
        0x0,
        0x75757575,
        0x75757575,
        0x6F6F6F6F,
        0x5F5F5F5F,
        0x48484848,
        0x0,
        0x92929292
    };
    
    const uint8_t txPower64[8] = {
        0x0,
        0x67676767,
        0x67676767,
        0x8B8B8B8B,
        0x9A9A9A9A,
        0x85858585,
        0x0,
        0xD1D1D1D1
    };

    const double txDelayCal[11*3] = {
    //    -0.13, 0.36, -0.05,//T2
    //    -0.14, 0.37, -0.03,//A1
    //    -0.20, 0.39, -0.06,//A2
    //    -0.07, 0.43, 0.04,//A3
    //    -0.15, 0.38, -0.01,//A4
    //    -0.03, 0.49, 0.07,//A5
    //    -0.18, 0.45, -0.07,//A6
    //    -0.08, 0.42, -0.00,//A7
    //    0.04, 0.51, 0.07,//A8
    //    -0.15, 0.38, -0.01,//A9
    //    -0.12, 0.44, 0.01,//A10
    154.82214201598609, 154.82214201598609, 154.82214201598609, //Need to fine tune this parameter
       155.5433333333333,   155.0400000000000,   155.4433333333333,
       155.5766666666667,   154.9922222222222,   155.4500000000000,
       155.4855555555555,   154.9122222222222,   155.3466666666667,
       155.5000000000000,   154.9377777777778,   155.3444444444445,
       155.3955555555556,   154.8555555555555,   155.2922222222222,
       155.4966666666667,   154.9100000000000,   155.3755555555556,
       155.4133333333333,   154.9233333333333,   155.3422222222222,
       155.3266666666667,   154.8377777777778,   155.2800000000000,
       155.5188888888889,   154.9277777777778,   155.3722222222222,
       155.4877777777778,   154.9033333333333,   155.3533333333333
    };

    uint32_t global_seq_count = 0;
    uint16_t global_tx_antenna_delay = 0;

    uint32_t global_pkt_delay_upper32 = 0;

   // uint64_t global_tag_poll_tx_time = 0;
//    uint64_t global_tag_anchor_resp_rx_time = 0;
    
    uint64_t global_tag_anchor_resp_rx_time[NUM_TOTAL_NODES];
    uint64_t global_tRR[NUM_TOTAL_NODES];
    uint64_t global_tRP[NUM_TOTAL_NODES];
    uint64_t global_tSR = 0;
    uint64_t global_tRF[NUM_TOTAL_NODES];
    uint64_t global_tSP[NUM_TOTAL_NODES];
    uint64_t global_tSF[NUM_TOTAL_NODES];
    uint8_t global_recv_pkt[512];

    uint32_t global_subseq_num = 0x0;
    uint8_t global_chan = 1;
    float global_distances[NUM_ANCHORS*NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS];

    struct ieee154_msg  {
        uint8_t frameCtrl[2];                             //  frame control bytes 00-01
        uint8_t seqNum;                                   //  sequence_number 02
        uint8_t panID[2];                                 //  PAN ID 03-04
        uint8_t destAddr[8];
        uint8_t sourceAddr[8];
        uint8_t messageType; //   (application data and any user payload)
        uint8_t anchorID;
        uint8_t fcs[2] ;                                  //  we allow space for the CRC as it is logically part of the message. However ScenSor TX calculates and adds these bytes.
    } __attribute__ ((__packed__));

    struct ieee154_final_msg  {
        uint8_t frameCtrl[2];                             //  frame control bytes 00-01
        uint8_t seqNum;                                   //  sequence_number 02
        uint8_t panID[2];                                 //  PAN ID 03-04
        uint8_t destAddr[2];
        uint8_t sourceAddr[2];
        uint8_t messageType; //   (application data and any user payload)
        uint8_t anchorID;
        float distanceHist[NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS];
        uint8_t fcs[2] ;                                  //  we allow space for the CRC as it is logically part of the message. However ScenSor TX calculates and adds these bytes.
    } __attribute__ ((__packed__));

    struct ieee154_bcast_msg  {
        uint8_t frameCtrl[2];                             //  frame control bytes 00-01
        uint8_t seqNum;                                   //  sequence_number 02
        uint8_t panID[2];                                 //  PAN ID 03-04
        uint8_t destAddr[2];
        uint8_t sourceAddr;
        uint8_t messageType; //   (application data and any user payload)
//        uint32_t data[2];
        uint8_t tSP[5];
        uint8_t tSF[5];
        uint8_t tRR[NUM_TOTAL_NODES][5];
        //uint64_t tRR[NUM_ANCHORS]; // time differences
        uint8_t fcs[2] ;                                  //  we allow space for the CRC as it is logically part of the message. However ScenSor TX calculates and adds these bytes.
    } __attribute__ ((__packed__));

    struct ieee154_msg msg;
    struct ieee154_final_msg fin_msg;
    struct ieee154_bcast_msg bcast_msg;
    
//    void to_lower_40bits(uint8_t* out, uint64_t in){//too slow!
//        unsigned i;
//        for(i=0;i<5;++i){
//            out[i] = (in>>(i<<3))&0xFF; 
//        }
//    }
#define to_lower_40bits(_OUT,_IN) _OUT[0]=(_IN)&0xFF;_OUT[1]=((_IN)>>8)&0xFF;_OUT[2]=((_IN)>>16)&0xFF;_OUT[3]=((_IN)>>24)&0xFF;_OUT[4]=((_IN)>>32)&0xFF
    
//    uint64_t from_lower_40_bits(uint8_t* in){ //too slow!
//        unsigned i;
//        uint64_t result = 0;
//        for(i=0;i<5;++i){
//            result <<=8;
//            result |= in[4-i]&0xFF;
//        }
//        return result;
//    }
#define from_lower_40_bits(_IN) (((_IN)[0])|(((uint64_t)(_IN)[1])<<8)|(((uint64_t)(_IN)[2])<<16)|(((uint64_t)(_IN)[3])<<24)|(((uint64_t)(_IN)[4])<<32))
    
