JEB12345/dwm1000_dspic/dwm_spi.c
        dw1000_populate_eui(eui_array, ANCHOR_EUI);
  	dwt_seteui(eui_array);
        dwt_setpanid(DW1000_PANID);

        // Set more packet constants
        dw1000_populate_eui(msg.sourceAddr, ANCHOR_EUI);
        dw1000_populate_eui(fin_msg.sourceAddr, ANCHOR_EUI);

        // hard code destination for now....
        dw1000_populate_eui(msg.destAddr, TAG_EUI);
        dw1000_populate_eui(fin_msg.destAddr, TAG_EUI);

        // We do want to enable auto RX
        dwt_setautorxreenable(1);
        // Let's do double buffering
        dwt_setdblrxbuffmode(0);
        // Disable RX timeout by setting to 0
        dwt_setrxtimeout(0);

        // Try pre-populating this
        msg.seqNum++;
        msg.messageType = MSG_TYPE_ANC_RESP;
        fin_msg.messageType = MSG_TYPE_ANC_FINAL;

        // Go for receiving
        dwt_rxenable(0);

    } else if (DW1000_ROLE_TYPE == TAG) {
	uint8_t eui_array[8];

        // First thing we do as a TAG is send the POLL message when the
        // timer fires
        // tag_state = TAG_SEND_POLL;

        // Allow data and ack frames
        dwt_enableframefilter(DWT_FF_DATA_EN | DWT_FF_ACK_EN);

        dw1000_populate_eui(eui_array, TAG_EUI);
  	dwt_seteui(eui_array);
        dwt_setpanid(DW1000_PANID);

        // Set more packet constants
        //dw1000_populate_eui(bcast_msg.sourceAddr, TAG_EUI);
	memset(bcast_msg.destAddr, 0xFF, 2);

        // Do this for the tag too
        dwt_setautorxreenable(1);
        dwt_setdblrxbuffmode(0);
        dwt_enableautoack(5 /*ACK_RESPONSE_TIME*/);

        // Configure sleep
        {
            int mode = DWT_LOADUCODE    |
                       DWT_PRESRV_SLEEP |
                       DWT_CONFIG       |
                       DWT_TANDV;
            if (dwt_getldotune() != 0) {
                // If we need to use LDO tune value from OTP kick it after sleep
                mode |= DWT_LOADLDO;
            }
            // NOTE: on the EVK1000 the DEEPSLEEP is not actually putting the
            // DW1000 into full DEEPSLEEP mode as XTAL is kept on
            dwt_configuresleep(mode, DWT_WAKE_CS | DWT_SLP_EN);
        }

    }
    /*****https://github.com/lab11/polypoint******/

//#if (DR_DISCOVERY == 0)
//    addressconfigure() ;                            // set up initial payload configuration
//#endif
//    instancesettagsleepdelay(POLL_SLEEP_DELAY, BLINK_SLEEP_DELAY); //set the Tag sleep time
//
//    // NOTE: this is the delay between receiving the blink and sending the ranging init message
//    // The anchor ranging init response delay has to match the delay the tag expects
//    // the tag will then use the ranging response delay as specified in the ranging init message
//    // use this to set the long blink response delay (e.g. when ranging with a PC anchor that wants to use the long response times != 150ms)
//    instancesetblinkreplydelay(FIXED_REPLY_DELAY);
////    instancesetblinkreplydelay(FIXED_LONG_BLINK_RESPONSE_DELAY);
//
//    //set the default response delays
//    instancesetreplydelay(FIXED_REPLY_DELAY, 0);

    dwt_setleds(1);

    return result;
}
unsigned delayed_tx = 0;
// Triggered after a TX
void app_dw1000_txcallback (const dwt_callback_data_t *txd) {
    //NOTE: No need for tx timestamping after-the-fact (everything's done beforehand)
}

void dwt_timer_cb(){
    dwm_status.timer_interrupt = 1;
}

// Triggered when we receive a packet
void app_dw1000_rxcallback (const dwt_callback_data_t *rxd) {
    int err;
    uint8_t rxtimestamp[5];
    
    if (rxd->event == DWT_SIG_RX_OKAY) {
        dwt_readrxdata(global_recv_pkt, rxd->datalength, 0);
        //Assume everything is a bcast msg for now
        struct ieee154_bcast_msg* msg_ptr;
        msg_ptr = (struct ieee154_bcast_msg*) global_recv_pkt;
        
        dwt_readrxtimestamp(rxtimestamp);
        if(msg_ptr->messageType == DWM_SEND_POLL){
            if(msg_ptr->sourceAddr==0){ //received poll from first node: start of new sequence
                //reset state
                memset(global_tag_anchor_resp_rx_time,0xFA,sizeof(global_tag_anchor_resp_rx_time));
                memset(global_tRR,0xFA,sizeof(global_tRR));
                memset(global_tRP,0xFA,sizeof(global_tRP));
                memset(global_tRF,0xFA,sizeof(global_tRF));
                memset(global_tSP,0xFA,sizeof(global_tSP));
                memset(global_tSF,0xFA,sizeof(global_tSF));
                //start transmit sequence
                dwm_status.tx_state = DWM_SEND_POLL;
                dwm_status.timer_func(dwm_status.node_id*2000,dwt_timer_cb);
            }
            //store information contained in and related to poll message            
            global_tRP[msg_ptr->sourceAddr] = from_lower_40_bits(rxtimestamp);
            global_tSP[msg_ptr->sourceAddr] = from_lower_40_bits(&global_recv_pkt[offsetof(struct ieee154_bcast_msg, tSP)]);
        } else if (msg_ptr->messageType == DWM_SEND_RESPONSE){
            //store information contained in and related to response message
            dwt_readrxtimestamp(rxtimestamp);
            global_tag_anchor_resp_rx_time[msg_ptr->sourceAddr] = from_lower_40_bits(rxtimestamp);
        } else if (msg_ptr->messageType == DWM_SEND_FINAL) {
            //store information contained in and related to final message
            global_tRF[msg_ptr->sourceAddr] = from_lower_40_bits(rxtimestamp);
            global_tRR[msg_ptr->sourceAddr] = from_lower_40_bits(msg_ptr->tRR[dwm_status.node_id]); //note: own id as we're reading "our" reception time on a remote node
            global_tSF[msg_ptr->sourceAddr] = from_lower_40_bits(msg_ptr->tSF);
            //TODO: trigger a TOF calculation when everything has been received
        }
        //TODO: handle incoming packets
        
        dwt_forcetrxoff();        
        dwt_setrxtimeout(0); //TODO: not sure if needed
        dwt_rxenable(0);

    }
//    int err;
//
//    if (DW1000_ROLE_TYPE == TAG) {
//
//        // The tag receives one packet: "ANCHOR RESPONSE"
//        // Make sure the packet is valid and matches an anchor response.
//        // Need to timestamp it and schedule a response.
//
//        if (rxd->event == DWT_SIG_RX_OKAY) {
//            struct ieee154_msg* msg_ptr;
//            uint8_t packet_type_byte;
//
//            // Get the timestamp first
//            uint8_t txTimeStamp[5] = {0, 0, 0, 0, 0};
////            global_tag_anchor_resp_rx_time = dwt_readrxtimestamphi32();
//            dwt_readrxtimestamp(txTimeStamp);
//            global_tag_anchor_resp_rx_time = (uint64_t) txTimeStamp[0] +
//                                             (((uint64_t) txTimeStamp[1]) << 8) +
//                                             (((uint64_t) txTimeStamp[2]) << 16) +
//                                             (((uint64_t) txTimeStamp[3]) << 24) +
//                                             (((uint64_t) txTimeStamp[4]) << 32);
//
//            // Get the packet
//            dwt_readrxdata(global_recv_pkt, rxd->datalength, 0);
//            msg_ptr = (struct ieee154_msg*) global_recv_pkt;
//            packet_type_byte = global_recv_pkt[offsetof(struct ieee154_msg, messageType)];
//
//            // Packet type byte is at a know location
//            if (packet_type_byte == MSG_TYPE_ANC_RESP) {
//                // Great, got an anchor response.
//                // Now send a final message with the timings we know in it
//
//                // First, set the time we want the packet to go out at.
//                // This is based on our precalculated delay plus when we got
//                // the anchor response packet. Note that we only add the upper
//                // 32 bits together and use that time because this chip is
//                // weird.
//                uint8_t anchor_id = msg_ptr->anchorID;
//                if(anchor_id >= NUM_ANCHORS) anchor_id = NUM_ANCHORS;
//
//                dwt_forcetrxoff();
//                uint16_t tx_frame_length = sizeof(bcast_msg);
//                
//                bcast_msg.seqNum++;
//                bcast_msg.messageType = MSG_TYPE_TAG_FINAL;
//                // Put at beginning of TX fifo
//                dwt_writetxfctrl(tx_frame_length, 0);
//                
//                dwt_setrxtimeout(0);
//                
//                uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
//                dwt_readsystime(TimeStamp);
//                uint64_t systimestamp = (uint64_t) TimeStamp[0] +
//                        (((uint64_t) TimeStamp[1]) << 8) +
//                        (((uint64_t) TimeStamp[2]) << 16) +
//                        (((uint64_t) TimeStamp[3]) << 24) +
//                        (((uint64_t) TimeStamp[4]) << 32);
//
//                //TODO: Hack.... But not sure of any other way to get this to time out correctly...
////                dwt_setrxtimeout(NODE_DELAY_US*(NUM_ANCHORS-anchor_id)+ANC_RESP_DELAY+1000);
////                uint32_t temp = dwt_readsystimestamphi32();
////                uint32_t delay_time = temp + ((convertmicrosectodevicetimeu32(TAG_SEND_FINAL_DELAY_US)>>8));
//                uint32_t delay_time = (uint32_t)((systimestamp)>>8) + ((convertmicrosectodevicetimeu32(TAG_SEND_FINAL_DELAY_US)>>8));
//                delay_time &= 0xFFFFFFFE;
//                dwt_setdelayedtrxtime(delay_time);
//                // Set the packet length
////                uint16_t tx_frame_length = offsetof(struct ieee154_bcast_msg, tRR) + 2;//TODO: this is wrong
//                
//                // Need to actually fill out the packet
//                to_lower_40bits(bcast_msg.tRR[0], global_tag_anchor_resp_rx_time);
//                to_lower_40bits(bcast_msg.tSF,systimestamp + (convertmicrosectodevicetimeu(TAG_SEND_FINAL_DELAY_US)));
//                
//                dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);
//                err = dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);
//                dwt_settxantennadelay(global_tx_antenna_delay);
//                tag_state = tag_stall;
//
//            } else if(packet_type_byte == MSG_TYPE_ANC_FINAL){
//                struct ieee154_final_msg* final_msg_ptr;
//                final_msg_ptr = (struct ieee154_final_msg*) global_recv_pkt;
//                int offset_idx = (final_msg_ptr->anchorID-1)*NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS;
//                memcpy(&global_distances[offset_idx],final_msg_ptr->distanceHist,sizeof(fin_msg.distanceHist));
//            }
//        } else if (rxd->event == DWT_SIG_RX_TIMEOUT) {
//
//        }
//
//    } else if (DW1000_ROLE_TYPE == ANCHOR) {
//
//        // The anchor should receive two packets: a POLL from a tag and
//        // a FINAL from a tag.
//
//        if (rxd->event == DWT_SIG_RX_OKAY) {
//            struct ieee154_bcast_msg* msg_ptr;
//            uint8_t packet_type_byte;
//            uint64_t rxtimestamp;
//            uint64_t systimestamp;
//            uint8_t subseq_num;
//
//
//            // Get the timestamp first
//            uint8_t txTimeStamp[5] = {0, 0, 0, 0, 0};
//            dwt_readrxtimestamp(txTimeStamp);
//            rxtimestamp = (uint64_t) txTimeStamp[0] +
//                        (((uint64_t) txTimeStamp[1]) << 8) +
//                        (((uint64_t) txTimeStamp[2]) << 16) +
//                        (((uint64_t) txTimeStamp[3]) << 24) +
//                        (((uint64_t) txTimeStamp[4]) << 32);
//
//            // tGet the packet
////            dwt_readrxdata(&packet_type_byte, 1, 15);
//            dwt_readrxdata(global_recv_pkt, rxd->datalength, 0);
//            msg_ptr = (struct ieee154_bcast_msg*) global_recv_pkt;
//            packet_type_byte = global_recv_pkt[offsetof(struct ieee154_bcast_msg, messageType)];
//
//
//            if (packet_type_byte == MSG_TYPE_TAG_POLL) {
//                // Got POLL
//                global_tRP = rxtimestamp;
////                global_tRP = dwt_readrxtimestamphi32();
//                //memcpy(&global_tSP,&global_recv_pkt[offsetof(struct ieee154_bcast_msg, tSP)],sizeof(uint64_t));
//                global_tSP = from_lower_40_bits(&global_recv_pkt[offsetof(struct ieee154_bcast_msg, tSP)]);
//
//                // Send response
//                dwt_forcetrxoff();
//                
//                // Set the packet length
//                // FCS + SEQ + PANID:  5
//                // ADDR:              16
//                // PKT:                1
//                // ANCHOR_ID:          1
//                // CRC:                2
//                // total              25
//                uint16_t tx_frame_length = sizeof(msg); // Should be 25
//                
//                dwt_writetxfctrl(tx_frame_length, 0);
//                
//                dwt_setrxtimeout(0);
//                
//                uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
//                dwt_readsystime(TimeStamp);
//                systimestamp = (uint64_t) TimeStamp[0] +
//                        (((uint64_t) TimeStamp[1]) << 8) +
//                        (((uint64_t) TimeStamp[2]) << 16) +
//                        (((uint64_t) TimeStamp[3]) << 24) +
//                        (((uint64_t) TimeStamp[4]) << 32);
//
//                // Calculate the delay
////                uint32_t dwt_time = dwt_readsystimestamphi32();
////                uint32_t delay_time = dwt_time + (convertmicrosectodevicetimeu32(ANC_RESP_DELAY)>>8);
//                uint32_t delay_time = (uint32_t)((systimestamp)>>8) + (convertmicrosectodevicetimeu32(ANC_RESP_DELAY)>>8);
//                delay_time &= 0xFFFFFFFE;
//                dwt_setdelayedtrxtime(delay_time);
//                global_tSR = systimestamp + (convertmicrosectodevicetimeu(ANC_RESP_DELAY));
//
//                dwt_writetxdata(tx_frame_length, (uint8_t*) &msg, 0);
//
//                err = dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);
//                
//                dwt_settxantennadelay(global_tx_antenna_delay);
//
//                //Reset all the distance measurements
//                memset(fin_msg.distanceHist, 0, sizeof(fin_msg.distanceHist));
//
//                anchor_state = anchor_wait_final;
//            } else if (packet_type_byte == MSG_TYPE_TAG_FINAL) {
//                // Got FINAL
//
//                // Read the whole packett
//                dwt_readrxdata((uint8_t*)&bcast_msg, sizeof(bcast_msg), 0);
//
//                global_tRF = rxtimestamp;
////                 global_tRF = dwt_readrxtimestamphi32();
//
//                // ONLY WORKS IF VARIABLES ARE 64bits!!!
//                // Correct TAG Times if rollover
//                uint64_t tRR_tmp = from_lower_40_bits(bcast_msg.tRR[0]);
//                uint64_t tSF_tmp = from_lower_40_bits(bcast_msg.tSF);
//                if(global_tSP > tRR_tmp){
//                    tRR_tmp += TWOPOWER40;
//                    tSF_tmp += TWOPOWER40;
//                }
//                if(tRR_tmp > tSF_tmp){
//                    tSF_tmp += TWOPOWER40;
//                }
//                to_lower_40bits(bcast_msg.tRR[0],tRR_tmp);
//                to_lower_40bits(bcast_msg.tSF,tSF_tmp);
//                
//                // Correct ANCHOR times if rollover
//                if(global_tRP > global_tSR){
//                    global_tSR += TWOPOWER40;
//                    global_tRF += TWOPOWER40;
//                }
//                if(global_tSR > global_tRF){
//                    global_tRF += TWOPOWER40;
//                }
//
//                long double tRF = (long double)(((uint64_t)global_tRF));
//                long double tSR = (long double)(((uint64_t)global_tSR));
//                long double tRR = (long double)from_lower_40_bits(bcast_msg.tRR[0]);//((((uint64_t)bcast_msg.tRR_H)<<32)|(((uint64_t)bcast_msg.tRR_L)));//NCHOR_EUI-1];
//                long double tSP = (long double)(((uint64_t)global_tSP));
//                long double tSF = (long double)from_lower_40_bits(bcast_msg.tSF);
//                long double tRP = (long double)(((uint64_t)global_tRP));
//
//                if(tRF != 0.0 && tSR != 0.0 && tRR != 0.0 && tSP != 0.0 && tSF != 0.0 && tRP != 0.0){
//                    
//                    long double aot = (tRF-tRP)/(tSF-tSP);
//                    long double tTOF = (tRF-tSR)-(tSF-tRR)*aot;
//                    long double dist = (tTOF*DWT_TIME_UNITS)/2;
//
//                    ////tTOF^2 + (-tRF + tSR - tRR + tSP)*tTOF + (tRR*tRF - tSP*tRF - tSR*tRR + tSP*tSR - (tSF-tRR)*(tSR-tRP)) = 0
////                    double a = 1.0;
////                    double b = -tRF + tSR - tRR + tSP;
////                    double c = tRR*tRF - tSP*tRF - tSR*tRR + tSP*tSR - (tSF-tRR)*(tSR-tRP);
////
////                    ////Perform quadratic equation
////                    double tTOF = (-b-sqrt(pow(b,2)-4*a*c))/(2*a);
////                    double dist = (tTOF * (double) DWT_TIME_UNITS) * 0.5;
//                    dist *= SPEED_OF_LIGHT;
//                    //double range_bias = 0.0;//dwt_getrangebias(global_chan, (float) dist, DWT_PRF_64M);
//#ifndef DW_CAL_TRX_DELAY
//                    dist += ANCHOR_CAL_LEN;
//                    dist -= txDelayCal[ANCHOR_EUI*NUM_CHANNELS + 1];
//#endif
//                    #ifdef DW_DEBUG
//                        printf("dist*100 = %d\r\n", (int)(dist*100));
//                        //printf("range_bias*100 = %d\r\n", (int)(range_bias*100));
//                    #endif
//                    //dist -= dwt_getrangebias(2, (float) dist, DWT_PRF_64M);
//                    fin_msg.distanceHist[global_subseq_num] = (float)dist;
//                    dwm_status.distance = dist;
//                }
//
//                // Get ready to receive next POLL
//                anchor_state = anchor_wait_receive;
//                dwt_rxenable(0);
//            }
//        }
//        else{
//            dwt_rxenable(0);
//        }
//    }
}

void send_poll(){
    //Reset all the tRRs at the beginning of each poll event
	memset(bcast_msg.tRR, 0, sizeof(bcast_msg.tRR));//TODO: hacked
    //bcast_msg.tRR = 0;//_H = bcast_msg.tRR_L = 0;
    
	// Through tSP (tSF is field after) then +2 for FCS
    uint16_t tx_frame_length = sizeof(bcast_msg);
	memset(bcast_msg.destAddr, 0xFF, 2);

	bcast_msg.seqNum++;
//	bcast_msg.subSeqNum = global_subseq_num;

	// First byte identifies this as a POLL
	bcast_msg.messageType = DWM_SEND_POLL;//MSG_TYPE_TAG_POLL;
    
    bcast_msg.sourceAddr = dwm_status.node_id;

	// Tell the DW1000 about the packet
	dwt_writetxfctrl(tx_frame_length, 0);

