JEB12345/dwm1000_dspic/dwm_spi.c
	// We'll get multiple responses, so let them all come in
	dwt_setrxtimeout(0);

	// Delay RX?
//	dwt_setrxaftertxdelay(1); // us
    
    uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
    dwt_readsystime(TimeStamp);
    uint64_t systimestamp = from_lower_40_bits(TimeStamp);

//	uint32_t temp = dwt_readsystimestamphi32();
	//uint32_t delay_time = temp + GLOBAL_PKT_DELAY_UPPER32;
	//(APP_US_TO_DEVICETIMEU32(NODE_DELAY_US) & DELAY_MASK) >> 8
//	uint32_t delay_time = temp + ((convertmicrosectodevicetimeu32(TAG_SEND_POLL_DELAY_US)>>8));
    uint32_t delay_time = (uint32_t)((systimestamp)>>8) + ((convertmicrosectodevicetimeu32(TAG_SEND_POLL_DELAY_US)>>8));
	//uint32_t delay_time = dwt_readsystimestamphi32() + GLOBAL_PKT_DELAY_UPPER32;
	delay_time &= 0xFFFFFFFE; //Make sure last bit is zero
	dwt_setdelayedtrxtime(delay_time);
    uint64_t tSP_tmp = systimestamp + (convertmicrosectodevicetimeu(TAG_SEND_POLL_DELAY_US));
    to_lower_40bits(bcast_msg.tSP,tSP_tmp);
	
	// Write the data
	dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);

	// Start the transmission
	dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);

	// MP bug - TX antenna delay needs reprogramming as it is
	// not preserved
	dwt_settxantennadelay(TX_ANTENNA_DELAY);
}

void send_response(){
    //Reset all the tRRs at the beginning of each poll event
	memset(bcast_msg.tRR, 0, sizeof(bcast_msg.tRR));//TODO: hacked
    //bcast_msg.tRR = 0;//_H = bcast_msg.tRR_L = 0;
    
	// Through tSP (tSF is field after) then +2 for FCS
    uint16_t tx_frame_length = sizeof(bcast_msg);
	memset(bcast_msg.destAddr, 0xFF, 2);

	bcast_msg.seqNum++;
//	bcast_msg.subSeqNum = global_subseq_num;

	// First byte identifies this as a POLL
	bcast_msg.messageType = DWM_SEND_RESPONSE;//MSG_TYPE_TAG_POLL;
    
    bcast_msg.sourceAddr = dwm_status.node_id;

	// Tell the DW1000 about the packet
	dwt_writetxfctrl(tx_frame_length, 0);

	// We'll get multiple responses, so let them all come in
	dwt_setrxtimeout(0);

	// Delay RX?
//	dwt_setrxaftertxdelay(1); // us
    
    uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
    dwt_readsystime(TimeStamp);
    uint64_t systimestamp = from_lower_40_bits(TimeStamp);

//	uint32_t temp = dwt_readsystimestamphi32();
	//uint32_t delay_time = temp + GLOBAL_PKT_DELAY_UPPER32;
	//(APP_US_TO_DEVICETIMEU32(NODE_DELAY_US) & DELAY_MASK) >> 8
//	uint32_t delay_time = temp + ((convertmicrosectodevicetimeu32(TAG_SEND_POLL_DELAY_US)>>8));
    uint32_t delay_time = (uint32_t)((systimestamp)>>8) + ((convertmicrosectodevicetimeu32(ANC_RESP_DELAY)>>8));
	//uint32_t delay_time = dwt_readsystimestamphi32() + GLOBAL_PKT_DELAY_UPPER32;
	delay_time &= 0xFFFFFFFE; //Make sure last bit is zero
	dwt_setdelayedtrxtime(delay_time);
    uint64_t tSR_tmp = systimestamp + (convertmicrosectodevicetimeu(ANC_RESP_DELAY));
    global_tSR = tSR_tmp;
	
	// Write the data
	dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);

	// Start the transmission
	dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);

	// MP bug - TX antenna delay needs reprogramming as it is
	// not preserved
	dwt_settxantennadelay(TX_ANTENNA_DELAY);
}

void send_final(){
    //Reset all the tRRs at the beginning of each poll event
	memset(bcast_msg.tRR, 0, sizeof(bcast_msg.tRR));//TODO: hacked
    //bcast_msg.tRR = 0;//_H = bcast_msg.tRR_L = 0;
    
	// Through tSP (tSF is field after) then +2 for FCS
    uint16_t tx_frame_length = sizeof(bcast_msg);
	memset(bcast_msg.destAddr, 0xFF, 2);

	bcast_msg.seqNum++;
//	bcast_msg.subSeqNum = global_subseq_num;

	// First byte identifies this as a POLL
	bcast_msg.messageType = DWM_SEND_FINAL;//MSG_TYPE_TAG_POLL;
    
    bcast_msg.sourceAddr = dwm_status.node_id;

	// Tell the DW1000 about the packet
	dwt_writetxfctrl(tx_frame_length, 0);

	// We'll get multiple responses, so let them all come in
	dwt_setrxtimeout(0);

	// Delay RX?
//	dwt_setrxaftertxdelay(1); // us
    
    uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
    dwt_readsystime(TimeStamp);
    uint64_t systimestamp = from_lower_40_bits(TimeStamp);

    unsigned i;
    for(i=0;i<NUM_TOTAL_NODES;++i){
        to_lower_40bits(bcast_msg.tRR[i], global_tag_anchor_resp_rx_time[i]);
    }
    
    uint32_t delay_time = (uint32_t)((systimestamp)>>8) + ((convertmicrosectodevicetimeu32(TAG_SEND_FINAL_DELAY_US)>>8));
    
	delay_time &= 0xFFFFFFFE; //Make sure last bit is zero
	dwt_setdelayedtrxtime(delay_time);
    to_lower_40bits(bcast_msg.tSF,systimestamp + (convertmicrosectodevicetimeu(TAG_SEND_FINAL_DELAY_US)));
	
	// Write the data
	dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);

	// Start the transmission
	dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);

	// MP bug - TX antenna delay needs reprogramming as it is
	// not preserved
	dwt_settxantennadelay(TX_ANTENNA_DELAY);
}

void instance_process(){
    static uint16_t ctr = 0;
    if(dwm_status.node_id==0){
        if(ctr%100==0){
            //start a new sequence
            //reset state
            memset(global_tag_anchor_resp_rx_time,0xFA,sizeof(global_tag_anchor_resp_rx_time));
            memset(global_tRR,0xFA,sizeof(global_tRR));
            memset(global_tRP,0xFA,sizeof(global_tRP));
            memset(global_tRF,0xFA,sizeof(global_tRF));
            memset(global_tSP,0xFA,sizeof(global_tSP));
            memset(global_tSF,0xFA,sizeof(global_tSF));
            
            dwt_forcetrxoff();
            send_poll();
            //kick start state machine
            dwm_status.tx_state = DWM_SEND_RESPONSE;
            dwm_status.timer_func(20000,dwt_timer_cb);
        }
    }
    
    ctr++;
    if(ctr>=100){
        ctr = 0;
    }
}

void incr_subsequence_counter(){
    global_subseq_num++;
    if(global_subseq_num > NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS+1){
        global_subseq_num = 0;
    }
}

// -------------------------------------------------------------------------------------------------------------------
// convert microseconds to device time
uint32_t convertmicrosectodevicetimeu32 (double microsecu)
{
    uint32_t dt;
    long double dtime;

    dtime = (microsecu / (double) DWT_TIME_UNITS) / 1e6 ;

