JEB12345/dwm1000_dspic/dwm_spi.c
    dt =  (uint32_t) (dtime) ;

    return dt;
}

// convert microseconds to device time
uint64_t convertmicrosectodevicetimeu (double microsecu)
{
    uint64_t dt;
    long double dtime;

    dtime = (microsecu / (double) DWT_TIME_UNITS) / 1e6 ;

    dt =  (uint64_t) (dtime) ;

    return dt;
}

/**
 * This function is the low level function used by the decaWave DWM1000 API
 */
int writetospi( uint16_t headerLength,
                const uint8_t *headerBuffer,
                uint32_t bodylength,
                const uint8_t *bodyBuffer)
{
    nSELECT = 0;
    write_data_SPI(headerBuffer, headerLength);
    write_data_SPI(bodyBuffer, bodylength);
    nSELECT = 1;
    return DWT_SUCCESS;
}

/**
 * This function is the low level function used by the decaWave DWM1000 API
 */
 int readfromspi( uint16_t	headerLength,
                const uint8_t *headerBuffer,
                uint32_t readlength,
                uint8_t *readBuffer)
 {
    nSELECT = 0;
    write_data_SPI(headerBuffer, headerLength);
    read_data_SPI(readlength, readBuffer);
    nSELECT = 1;
    return DWT_SUCCESS;
 }

/**
 * Reads num_bytes of data from the device
 */
void read_data_SPI(uint16_t num_bytes, uint8_t* rec)
{
    uint16_t cur_byte;
    for(cur_byte=0;cur_byte<num_bytes;cur_byte++){
        SPI2BUF = 0x00;
        while(!SPI2STATbits.SPIRBF);
        rec[cur_byte] = (uint8_t)(SPI2BUF&0xFF);
    }
}

/**
 * Writes num_bytes of data to the device
 */
void write_data_SPI(const uint8_t* data, uint16_t num_bytes)
{
    uint16_t cur_byte;
    uint8_t blahRead;
    for(cur_byte=0;cur_byte<num_bytes;cur_byte++){
        SPI2BUF = data[cur_byte];
        while(!SPI2STATbits.SPIRBF);
        blahRead = SPI2BUF;
    }
}

/**
 * Code Copied directly or modified
 * from polypoint github code
 * https://github.com/lab11/polypoint
 */
void dw1000_populate_eui (uint8_t *eui_buf, uint8_t id) {
  eui_buf[0] = id;
  eui_buf[1] = 0x55;
  eui_buf[2] = 0x44;
  eui_buf[3] = 'N';
  eui_buf[4] = 'P';
  eui_buf[5] = 0xe5;
  eui_buf[6] = 0x98;
  eui_buf[7] = 0xc0;
}
/*****https://github.com/lab11/polypoint******/

void dwm_compute_distances()
{
    unsigned i;
    
//     double tRF;
//         double tSR;
//         double tRR; 
//         double tSP;
//         double tSF;
//         double tRP;
//         double aot;
//         double tTOF;
//         double dist;
    for(i=0;i<NUM_TOTAL_NODES;++i){
        // Correct TAG Times if rollover
        uint64_t tRR_tmp = global_tRR[i];
        uint64_t tSF_tmp = global_tSF[i];
        
        if (global_tSP[i] > tRR_tmp) {
            tRR_tmp += TWOPOWER40;
            tSF_tmp += TWOPOWER40;
        }
        if (tRR_tmp > tSF_tmp) {
            tSF_tmp += TWOPOWER40;
        }
        global_tRR[i] = tRR_tmp;
        global_tSF[i] = tSF_tmp;

        // Correct ANCHOR times if rollover
        if (global_tRP[i] > global_tSR) {
            global_tSR += TWOPOWER40;
            global_tRF[i] += TWOPOWER40;
        }
        if (global_tSR > global_tRF[i]) {
            global_tRF[i] += TWOPOWER40;
        }
//
//        tRF = ( double) global_tRF[i];
//        tSR = ( double) global_tSR;
//        tRR = ( double) global_tRR[i]; 
//        tSP = ( double) global_tSP[i];
//        tSF = ( double) global_tSF[i];
//        tRP = ( double) global_tRP[i];
        
        uint64_t tRF_tRP = global_tRF[i]-global_tRP[i];
        uint64_t tSF_tSP = global_tSF[i]-global_tSP[i];
        uint64_t tRF_tSR = global_tRF[i]-global_tSR;
        uint64_t tSF_tRR = global_tSF[i]-global_tRR[i];
        long double tmp,tmp2;
        
        //if (tRF != 0.0 && tSR != 0.0 && tRR != 0.0 && tSP != 0.0 && tSF != 0.0 && tRP != 0.0) {
            tmp = (long double) tRF_tRP;
            tmp2 = (long double) tSF_tSP;
            tmp /= tmp2; //aot
            tmp2 = (long double) tSF_tRR;
            tmp *= tmp2; //(tSF - tRR) * aot
            tmp *= -1.; //-(tSF - tRR) * aot
            tmp2 = (long double)tRF_tSR;
            tmp += tmp2; //tTOF
            tmp /= 426.40678517020814; //dist
            //aot = (tRF - tRP) / (tSF - tSP);
            //tTOF = (tRF - tSR)-(tSF - tRR) * aot;
            //dist = (tTOF * DWT_TIME_UNITS) / 2;
              
            //dist *= SPEED_OF_LIGHT;
//            
            dwm_status.distance[i] = (double)tmp;
        //}
    }
}

void dwt_timer_interrupt()
{
    dwm_status.timer_interrupt = 0;
    
    switch(dwm_status.tx_state){
        case DWM_SEND_POLL:
            dwm_status.tx_state = DWM_SEND_RESPONSE;
            dwt_forcetrxoff();
            send_poll();
            dwm_status.timer_func(20000+2000*dwm_status.node_id,dwt_timer_cb);
            break;
        case DWM_SEND_RESPONSE:
            dwm_status.tx_state = DWM_SEND_FINAL;
            dwt_forcetrxoff();
            send_response();
            dwm_status.timer_func(20000+2000*dwm_status.node_id,dwt_timer_cb);
            break;
        case DWM_SEND_FINAL:
            dwm_status.tx_state = DWM_COMPUTE_TOF;
            dwt_forcetrxoff();
            send_final();
            dwm_status.timer_func(20000-2000*dwm_status.node_id,dwt_timer_cb);
            break;
        case DWM_COMPUTE_TOF:
            dwm_status.tx_state = DWM_SEND_POLL;
            //TODO: compute results
            dwm_compute_distances();
            break;
        default:
            //error!!!
            break;
    };
}
/**
 * This interrupt function is tied to the IRQ pin from the DWM1000 module
 */
void __attribute__((__interrupt__, __no_auto_psv__)) _INT2Interrupt(void)
{
    // This is the interrupt handler used by the DWM1000 API library.
    dwm_status.irq_enable = 1;
    IFS1bits.INT2IF = 0;
}
